[
    {
        "author": "a...k",
        "recommendation": true,
        "stars": "5",
        "content": "Telefon Redmi Note 9 Pro wygląda super, ma wszystko czego potrzebuję.\nDwie tafle szkła z przodu i z tyłu. Pracuje wyśmienicie, nie nagrzewa się, cały czas chłodny w czasie normalnej pracy.\nBardzo ładne zdjęcia i filmy do 4K 30fps ze stabilizacją cyfrową. Czytnik linii papilarnych w bocznej części telefonu i pracuje perfekcyjnie, bateria 5020mAh trzyma długo pojemność, szybka ładowarka w zestawie 33W, od 15 do 50% ładuje w 15 minut, a do 100% w 75 minut. \nWybudzanie ekranu przez dwukrotne puknięcie w ekran lub przez podniesienie, odblokowanie twarzą, odciskiem palca, wzorem,pinem itp. Jest mała biała dioda powiadomień, a same powiadomienia nie zawodzą.\nDołączone przyciemniane etui na plecki, idealnie spasowane i ładne wcięcie na odcisk palca z zasłanianym wejściem na gniazdo usb typu C. Pamięć 128 GB z możliwością rozbudowy dzięki dodatkowej, niezależnej karcie micro Sd , dwie karty sim, Ram 6GB. Silnik wibracyjny typy liniowego sprawuje się świetnie.Procesor to Snapdragon 720G. Jest gniazdo słuchawkowe i radio fm z możliwością nagrywania audycji czy muzyki. Mógłbym jeszcze tak długo pisać bo ma sporo funkcji i zalet. Gorąco polecam ten model pomimo, że testuję go od 12 sierpnia 2020, czyli dopiero  2 tygodnie.",
        "pros": [
            "aparat 64mpx",
            "bateria",
            "czas pracy na baterii",
            "dioda powiadomień",
            "dual sim",
            "ekran",
            "funkcjonalność",
            "gniazdo microsd",
            "ładowarka",
            "łatwość obsługi",
            "mini jack",
            "nfc",
            "wygląd"
        ],
        "cons": [
            "brak słuchawek",
            "radio fm bez rds",
            "ustawianie wcięcia"
        ],
        "purchased": true,
        "submit_date": "2020-08-21 21:20:23",
        "purchase_date": "2020-08-08 19:03:06",
        "useful": 29,
        "useless": 7,
        "opinion_id": "12989515"
    },
    {
        "author": "d...s",
        "recommendation": true,
        "stars": "5",
        "content": "Pierwszy raz posiadam telefon pod marką Xiaomi. Mimo że niby telefon z niższej półki to wykonanie jak dla mnie super. Telefon gotowy do bezpiecznego użycia po wyciągnięciu z pudełka. W pudełku etui, na szkle folia. Myślałem że się nie przyzwyczaję do czytnika lini papilarnych w przycisku włączania / wybudzania, jednak rozwiązanie wydaje mi się super. Wydajność telefonu bardzo dobra. Oczywiści zgodnie z prawem Murphy'ego telefon upadł mi w pierwszy dzień i to dosyć nieładnie, na szczęście dzięki etui nic się nie stało. Bardzo ładny wyświetlacz, wydaje mi się bardzo fajny aparat, fajna ilość pikseli dającą fajną rozdzielczość, obiektyw jasny. Soczewka szerokokątna ciut deformuje ale przy tej wielkości obiektywu myślę że to trudne otrzymać idealne rozwiązanie. Super bateria i bardzo szybkie ładowanie.",
        "pros": [
            "czas pracy na baterii",
            "funkcjonalność",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons": [],
        "purchased": true,
        "submit_date": "2020-06-05 21:43:39",
        "purchase_date": "2020-05-22 00:27:52",
        "useful": 26,
        "useless": 10,
        "opinion_id": "12600305"
    },
    {
        "author": "6...1",
        "recommendation": true,
        "stars": "5",
        "content": "super telefon za małą kasę - kupiony w przedsprzedaży - z szkłem i opaską w cenie",
        "pros": [
            "czas pracy na baterii",
            "funkcjonalność",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons": [],
        "purchased": true,
        "submit_date": "2020-06-13 07:55:18",
        "purchase_date": "2020-05-22 07:35:51",
        "useful": 6,
        "useless": 7,
        "opinion_id": "12641473"
    },
    {
        "author": "s...k",
        "recommendation": true,
        "stars": "4.5",
        "content": "Telefon w tej cenie jest ok. Mam go miesiąc. Na pewno wielkim plusem jest bateria, której pojemność zapewnia jak dla mnie 3 dni bez ładowania oraz wyświetlacz, który bardzo słabo się grzeje. Nie jestem maniakiem gier, więc nie wiem jak się nadaje do tego. Aparat, jak aparat w telefonie. Ja ze zdjęć na szybko i nie mając swojego sprzętu foto przy sobie, jestem zadowolony. Jeśli mają to być fotografie, byłem, widziałem, dobrze, że mam aparat przy sobie, gdyż coś się dzieje, to nie można narzekać. Wideo, to samo co fotografie, da się spokojnie oglądać. Oprogramowanie z nakładką M11 jest do zaakceptowania. Dla mnie wadą jest to, że nie można ustawić oddzielnie głośności powiadomień (nie mówiąc już o poszczególnych powiadomieniach) i głośności dzwonka telefonu. Brakuje mi też wybieralnej listy alfabetu w kontaktach po prawej czy lewej stronie. Jazda windą od góry do dołu, mimo że szybka, jest irytująca.",
        "pros": [
            "czas pracy na baterii",
            "ekran",
            "funkcjonalność",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons": [
            "dioda powiadomień"
        ],
        "purchased": true,
        "submit_date": "2020-11-04 21:20:46",
        "purchase_date": "2020-10-03 20:21:24",
        "useful": 2,
        "useless": 4,
        "opinion_id": "13325277"
    },
    {
        "author": "g...k",
        "recommendation": true,
        "stars": "5",
        "content": "Bardzo dobry smart _ )",
        "pros": [
            "czas pracy na baterii",
            "funkcjonalność",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons": [],
        "purchased": true,
        "submit_date": "2020-07-08 17:23:34",
        "purchase_date": "2020-07-05 16:43:54",
        "useful": 7,
        "useless": 2,
        "opinion_id": "12776221"
    },
    {
        "author": "L...m",
        "recommendation": true,
        "stars": "5",
        "content": "Jak narazie to początek przygody z tym modelem telefonu. Oceny dokonałem pod kontem estetycznym. Jeżeli chodzi o specyfikacje spełnia moje oczekiwania w 95%  bo 5% to brak AMOLED .\nJest tacka na 2xSIM + SD \nIR\nNFC\nduża bateria\nBT 5.0\nWIFI DUAL Chanel jeśli dobrze czytałem.\nNie wiem co z siecią i 5G i danych w tym modelu. \nTak czy inaczej 4+ jeśli chodzi o plecki. Palcują się strasznie i wystaje mocno obiektyw aparatów.\nMiło że pomyślano o futerale na plecy i foli albo szkle ochronnym.",
        "pros": [
            "czas pracy na baterii",
            "funkcjonalność",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons": [],
        "purchased": true,
        "submit_date": "2020-05-29 22:24:57",
        "purchase_date": "2020-05-22 21:42:22",
        "useful": 6,
        "useless": 8,
        "opinion_id": "12552552"
    },
    {
        "author": "e...o",
        "recommendation": true,
        "stars": "5",
        "content": "Jakość bardzo dobra, dodane etui ochronne, oczywiście ładowarka :) i słuchawki. Idealny do przeglądania map, stron internet, itd; Technicznie i cenowo przewyższa inne smartfony. Zamówiłam go na przedsprzedaży, na której dodali jeszcze rewelacyjną opaskę Mi Smart  Band 4, z której jestem bardzo zadowolona. Aktualizacje telefonu przebiegają płynnie. Urządzenie, mimo że kilka razy nurkowało w kałuży, nie zawiesza się. Ładowanie telefonu bardzo szybkie. Obecnie planuję zamówić drugi :) Szczerze polecam.",
        "pros": [],
        "cons": [],
        "purchased": true,
        "submit_date": "2020-11-29 12:04:49",
        "purchase_date": "2020-05-22 14:30:39",
        "useful": 2,
        "useless": 1,
        "opinion_id": "13467789"
    },
    {
        "author": "h...r",
        "recommendation": true,
        "stars": "5",
        "content": "Super smartfon, już drugi w rodzinie. Obawiałam się, że będzie bolała dłoń przy szerszym od poprzedniego a tu niespodzianka. Fajnie leży w dłoni. Jeśli komuś zależy na dobrych zdjęciach powinien kupić ten typ Redmi Note 9 Pro. Jeszcze nie zdążyłam wypróbować wszystkich opcji. Ale jakość powala.",
        "pros": [
            "aparat 64mpx",
            "bateria",
            "czas pracy na baterii",
            "dioda powiadomień",
            "dual sim",
            "ekran",
            "etui w zestawie",
            "funkcjonalność",
            "gniazdo microsd",
            "ładowarka",
            "łatwość obsługi",
            "mini jack",
            "nfc",
            "radio fm bez rds",
            "ustawianie wcięcia",
            "wygląd"
        ],
        "cons": [
            "brak słuchawek"
        ],
        "purchased": true,
        "submit_date": "2020-11-20 23:03:13",
        "purchase_date": "2020-11-04 18:31:58",
        "useful": 2,
        "useless": 1,
        "opinion_id": "13420862"
    },
    {
        "author": "Tomasz",
        "recommendation": true,
        "stars": "5",
        "content": "Miałem Xiaomi RN4x i zamieniłem na RN9 Pro. Szybkość działania lepsza, wyświetlacz też lepszy. Po tygodniu użytkowania ciężko stwierdzić jak zachowuje się bateria (musi się ułożyć). Przy moim użytkowaniu (dużo rozmów i SMS, trochę wi-fi i danych) bateria starcza na ok. 2,5 do 3 dni. SOT na chwilę obecną to 5 godz. 4 min przy 50% baterii.",
        "pros": [
            "czas pracy na baterii",
            "funkcjonalność",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons": [],
        "purchased": true,
        "submit_date": "2020-06-04 06:58:59",
        "purchase_date": "2020-05-22 00:18:38",
        "useful": 8,
        "useless": 5,
        "opinion_id": "12584239"
    },
    {
        "author": "o...a",
        "recommendation": false,
        "stars": "1",
        "content": "nic",
        "pros": [],
        "cons": [],
        "purchased": true,
        "submit_date": "2021-04-21 09:28:33",
        "purchase_date": "2021-04-09 15:10:36",
        "useful": 0,
        "useless": 0,
        "opinion_id": "14328058"
    }
]